<template>
  <div class="swiper__container">
    <div class="wrap-content">
      <div class="content">
        <div class="tab-container">
          <div class="tab--list">
            <div
              class="tab-btn"
              v-for="t in contentList"
              :key="t"
              :class="{ activeTab: currentTab.title === t.title }"
              @click="currentTab = t"
            >
              {{ t.title }}
              <div class="ancor-line"></div>
            </div>
          </div>
        </div>
        <img :src="`/img/${currentTab.url}.jpeg`" alt="" />
      </div>
      <div class="current-desc">
        <h4>О услуге:</h4>
        <p>{{ currentTab.txt }}</p>
      </div>
    </div>
  </div>
</template>

<script setup>
import { ref } from "vue";

const contentList = [
  {
    title: "Автоматизированные линии листовой холодной штамповки ",
    txt: "Предлагаем производство металлоизделий крупными партиями на современных автоматизированных линиях. Подобное решение подходит для выпуска строительного крепежа разного типа, контактов и зажимов для электрофурнитуры, стандартных и нестандартных шайб, колпачков, уголков, прижимов, держателей и другой продукции. При крупносерийном производстве такое решение позволяет сократить финансовые расходы и повысить производительность. Цена одной выпускаемой единицы будет минимальной, процесс наладки линии для выпуска осуществляется в сжатые сроки, благодаря отлаженным процессам и квалификации наших инженеров. ",
    url: "172950595_xl_normal_none",
  },
  {
    title: "Ручная холодная листовая штамповка",
    txt: "Для небольших партий продукции рекомендуется ручная штамповка. Листовая холодная штамповка применяется для операций глубокой и обычной вытяжки, производства деталей с петлями, резьбой, отбортовкой. Для изготовления также могут применяться и другие операции, которые требуют ручного труда оператора и строгого визуального контроля.",
    url: "140394721_xl_normal_none",
  },
  {
    title: "Холодная объемная штамповка",
    txt: "Для выпуска полых и сплошных стержней разного сечения применяется объемная холодная штамповка. Такой вариант производства подходит для выпуска многогранных, цилиндрических, шлицевых, зубчатых изделий, стаканов цилиндрического типа с дном различной конфигурации. Также объемная штамповка подходит для производства деталей с большой толщиной, пуклей, буртиком, клеймами, другими элементами. ",
    url: "60758243_xl_normal_none",
  },
  {
    title: "Серийная сварка изделий из черных и цветных металлов",
    txt: "Для серийного выпуска металлических опор, закладных, уголков, сварных фланцев, деталей основания используются автоматизированные посты ручной и автоматизированной сварки. Такие изделия отличаются высокой геометрической стабильностью, постоянным качеством стыков и швов. Для выпуска используется серийная сварка, что сокращает время на выпуск продукции с сохранением качества.  ",
    url: "123769407_xl_normal_none",
  },
  {
    title: "Контактная сварка изделий",
    txt: "Для работы с тонколистовыми изделиями, выпуска сложных изделий с точным и качественным сварным соединением используется контактная технология сварки. Толщина получаемого сварного шва будет минимальной, деформации металла в точках соединения исключаются. Поверхность изделий сохраняется эстетику и декоративность.",
    url: "120325950_xl_normal_none",
  },
  {
    title: "Рубка, гибка, перфорирование для габаритных тонколистовых изделий ",
    txt: "Методы рубки, гибки и перфорирования применяются для выпуска рам, отливов, кожухов, защитных экранов, корпусов оборудования и прочих сходных изделий. Технология позволяет работать с нержавеющей сталью, окрашенными металлическими изделиями, цветными металлами. ",
    url: "131415065_xl_normal_none",
  },
  {
    title: "Литье изделий из пластика ",
    txt: "Современный цех пластикового литья с современными термопластавтоматами предлагает выпуска изделий из пластиков. Объем впрыска сырья составляет 400 куб.см, что обеспечивает оперативность производства, быстрые сроки выпуска готовой продукции. Подходит для организации производства комплектующих, металлопластиковых комплектующих. ",
    url: "153298055_xl_normal_none",
  },
  {
    title:
      "Проектирование, моделирование и создание станочной оснастки для производства .",
    txt: "Для серийного производства предлагается комплекс работ по проектированию, моделированию и запуску производственной линии. Нашими инженерами и сотрудниками собственного конструкторского бюро будет реализован полный инжиниринговый цикл. Это разработка и согласование параметров изделий, моделирование технологических процессов, планирование станочной оснастки для выпуска. Наши инженеры подскажут лучшие модернизации для изделий, проведут замену материалов с сохранением качества и сокращением финансовых затрат на сырье. Будут проведены расчеты допустимых нагрузок, стойкость к неблагоприятным внешним факторам, проведены все необходимые испытания. ",
    url: "157407547_xl_normal_none",
  },
  {
    title:
      "Планово-экономическое обоснование запуска производственного процесса для новых изделий ",
    txt: "Стоимость готовых изделий при равном объеме материалов может отличаться. Это зависит от выбранного метода производства, объема партии и других факторов. Для малых партий продукции нет смысла в изготовлении дорогостоящей, сложной оснастки. Для быстрого запуска и начала производства рекомендуются ручные методы штамповки. Стоимость оснастки в этом случае будет нулевой, что оптимизирует расходы. Для крупносерийного производства обосновано строительство нескольких комплектов рабочей оснастки. ",
    url: "50690842_xl_normal_none",
  },
  {
    title:
      "Инженерное сопровождение металлоизделий (расчет усилий и допустимых нагрузок, модификаций)",
    txt: "По разным причинам в процессе производства может потребоваться внесение изменений и модификаций в конструкцию выпускаемого изделия. В большинстве случаев на такие изменения небольшие, они не требуют проведения полной модернизации установленной оснастки или изменения всей производственной линии. Чаще требуется изготовление новых пуансонов для штамповки изделий, толкателей, модернизированных матриц. Это проводится в короткие сроки, позволяет максимально быстро начать выпуск изделий с требуемыми параметрами.",
    url: "80331336_xl_normal_none",
  },
];
const currentTab = ref(contentList[0]);
</script>

<style lang="scss" scoped>
@import "../fluid.sass";
.swiper__container {
  position: relative;
  display: flex;
  align-items: center;
  height: 100%;
  background: #000;
  background-image: linear-gradient(#000000b3, #000000b3),
    url(../assets/3page.jpg);
  background-size: cover;
}
.wrap-content {
  position: relative;
  display: flex;
  flex-direction: column;
  padding-top: 85px;
  width: 100vw;
  height: 100vh;
}
.content {
  background: rgba(31, 31, 31, 0.596);
  color: #fff;
  box-shadow: 0px 4px 8px rgba(0, 0, 0, 0.1);
  position: relative;
  display: flex;
  align-items: center;
  justify-content: space-between;
  width: 100%;
  @include fluid("max-height", 600);
  img {
    @include fluid("margin-left", 20);
    @include fluid("max-width", 700);
  }
}
.bg {
  display: none;
}
.current-desc {
  display: flex;
  align-items: flex-start;
  justify-content: center;
  flex-direction: column;
  height: 100%;
  @include fluid("font-size", 18);
  @include fluid("padding", 20);
  @include fluid("gap", 20);
  background: #2e2e2e6c;
  color: #fff;
}
.tab--list {
  display: flex;
  flex-wrap: wrap;
  @include fluid("gap", 20);
  position: relative;
  @include fluid("margin-top", 50);
}
.tab-btn {
  text-align: left;
  @include fluid("font-size", 18);
  @include fluid("width", 400);
  cursor: pointer;
  transition: all 0.2s ease 0.01s;
  border-left: 3px #ffd400 solid;
  padding-left: 10px;
}
.activeTab {
  color: #ffd400;
  font-weight: 500;
  .ancor-line {
    opacity: 1;
    width: 100%;
  }
}
.tab-btn:hover {
  color: #ffd400;
}
@media (min-width: 200px) and (max-width: 461px) {
  .txt {
    z-index: 2;
    @include fluid("margin-left", 50);
  }
  .current-desc {
    @include fluid("padding-top", 150);
    justify-content: flex-start;
  }
}
@media (min-width: 200px) and (max-width: 600px) {
  .content {
    flex-direction: column;
    @include fluid("gap", 70);
    max-height: none;
    .txt {
      margin: 0;
      padding: 40px;
    }
    img {
      @include fluid("margin-left", 20);
      @include fluid("max-width", 500);
    }
    .text-xl {
      @include fluid("font-size", 40);
      color: rgb(250, 121, 15);
      font-weight: bold;
    }
    .fz16 {
      @include fluid("font-size", 27);
      color: #fff;
      font-weight: bold;
    }
  }
  .current-desc {
    @include fluid("padding-top", 150);
    justify-content: flex-start;
  }
}
</style>
