<template>
  <div class="swiper__container">
    <swiper
      :modules="modules"
      :slides-per-view="1"
      navigation
      :pagination="{ clickable: true }"
      :scrollbar="{ draggable: true }"
    >
      <swiper-slide
        ><div class="content">
          <div class="txt">
            <h1 class="text-xl">Штамповка деталей из листового металла</h1>
            <p>
              Штамповка листового металла — распространенная технология,
              благодаря которой производят детали практически для любой
              промышленной отрасли. В статье мы опишем суть штамповки, а также
              рассмотрим основные виды штамповочных операций.
            </p>
            <p>
              Штамповка — это процесс, в результате которого заготовки плоского
              проката — листы, ленты и полосы — изменяют свой размер и
              геометрическую форму. Операция позволяет получать как простые и
              миниатюрные детали, так и габаритные изделия сложной
              геометрической формы.
            </p>
          </div>
          <img
            src="https://keyprod.ru/wp-content/uploads/2018/01/%D0%A8%D1%82%D0%B0%D0%BC%D0%BF%D1%8B-3D-%D0%BC%D0%BE%D0%B4%D0%B5%D0%BB%D0%B8-%D1%87%D0%B5%D1%80%D1%82%D0%B5%D0%B6%D0%B8-%D0%B8-%D0%BE%D0%BF%D0%B8%D1%81%D0%B0%D0%BD%D0%B8%D0%B5.png"
            alt=""
          /></div
      ></swiper-slide>
      <swiper-slide
        ><div class="content">
          <div class="txt">
            <h1 class="text-xl">Принцип работы</h1>
            <p>
              Для штамповки листов необходимы пресс и рабочий орган, оказывающий
              давление на металл — штамп. В качестве штампа выступают два
              элемента — матрица и пуансон.
              <br /><br />
              Матрица — это полость с углублениями, в которой и формируется
              нужная геометрия заготовки. Устанавливается матрица на неподвижную
              часть станка.
              <br /><br />
              Пуансон — это подвижная половина штампа с выступающими частями,
              которые вдавливают металл в матрицу, тем самым формируя нужную
              форму заготовки. Пуансон располагается в верхней части штампа на
              ползуне пресса.
            </p>
          </div>
        </div></swiper-slide
      >
      <swiper-slide
        ><div class="content">
          <div class="txt">
            <h1 class="text-xl">Какое оборудование используется</h1>
            <p>Сами станки различаются по типу привода.</p>
            <p class="fz16">
              Кривошипно-шатунные прессы — работа станка основана на
              преобразовании крутящего момента кривошипно-шатунным механизмом.
              Это старейший вид прессового оборудования, работающего за счет
              возвратно-поступательного движения.
              <br /><br />
              Гидравлические прессы — движение пуансона осуществляется за счет
              жидкости, которая толкает соответствующие приводы. Это наиболее
              мощное оборудование, давление которого достигает 75 000 тонн в
              зависимости от модели.
              <br /><br />
              Радиально-ковочные прессы — используются для горячей формовки
              деталей цилиндрической формы. Этот массивный станок, оборудованный
              индукционной печой для разогрева заготовки, позволяет обрабатывать
              заготовки длиной до 18 метров.
              <br /><br />
              Электромагнитные прессы — относительно новое оборудование,
              работающее за счет электромагнитного поля, которое давит на
              сердечник с проволочной обмоткой. Сердечник перемещает ползун с
              установленным пуансоном к матрице. Возврат происходит за счет
              пружин. Оборудование способно оказывать давление до 2,5 тонн, при
              этом ползун имеет небольшой запас хода — всего 10 мм.
            </p>
          </div>
          <img
            src="https://elektroautomatika.ru/layout_bs4/images/product_catalog/shtamp01_mod-min.png"
            alt=""
          /></div
      ></swiper-slide>
      <swiper-slide
        ><div class="content">
          <div class="txt">
            <h1 class="text-xl">Какие виды штамповки бывают</h1>
            <p>
              Существует два вида штамповки — холодная и горячая. При горячей
              штамповке используют термическое воздействие, при холодной —
              металл не нагревают.
            </p>
            <p class="fz16">
              Холодная штамповка деталей из листового металла может
              производиться в непрерывном потоке — то есть за одной штамповочной
              операцией сразу следует другая. Поэтому ее используют на
              производствах конвейерного типа — автомобильное производство,
              приборостроительная отрасль, заводы бытовой техники.
              <br /><br />
              К холодной штамповке деталей из листового металла относят свыше
              восемнадцати способов пластической деформации. Мы перечислим
              наиболее распространенные из них.
            </p>
          </div>
        </div></swiper-slide
      >
      <swiper-slide
        ><div class="content">
          <div class="txt">
            <h1 class="text-xl">Автоматическая холодная листовая штамповка</h1>
            <p class="fz16">
              Строительные крепления, монтажные кляймеры, клипсы, электрические
              зажимы и контакты, нестандартные и стандартные шайбы, уголки,
              колпачки, держатели, прижимы и прочее прочее. Наша основная
              работа. Автоматической штамповкой изготавливаются детали крупных
              партий. Этот метод обработки металлов дешевле, быстрее и удобнее
              иных видов обработки металлов.
            </p>
          </div>
          <img
            src="../assets/172950595_xl_normal_none.jpg"
            alt=""
          /></div
      ></swiper-slide>
      <swiper-slide
        ><div class="content">
          <div class="txt">
            <h1 class="text-xl">Ручная холодная листовая штамповка</h1>
            <p class="fz16">
              Всё, что невозможно или неудобно изготавливать автоматической
              штамповкой. Сюда входит работа небольшими партиями, вытяжка и
              глубокая вытяжка, изготовление деталей с резьбой, петлёй или
              отбортовкой
            </p>
          </div>
          <img
            src="../assets/140394721_xl_normal_none.jpg"
            alt=""
          /></div
      ></swiper-slide>
      <swiper-slide
        ><div class="content">
          <div class="txt">
            <h1 class="text-xl">Холодная объемная штамповка</h1>
            <p class="fz16">
              Нечастый вид штамповки, который мы освоили и успешно применяем.
              Сюда относятся изделия большой толщины, детали с
              утонением/утолщением, формированием буртиков, пуклей, клеймом и
              прочими техническими элементами, требующими подобной работы.
            </p>
          </div>
          <img
            src="../assets/60758243_xl_normal_none.jpg"
            alt=""
          /></div
      ></swiper-slide>
      <swiper-slide
        ><div class="content">
          <div class="txt">
            <h1 class="text-xl">
              Серийная сварка изделий из черных и цветных металлов
            </h1>
            <p class="fz16">
              Для нужд строительства сварочный цех нашего завода серийно
              изготавливает закладные детали, металлические опоры, массивные
              уголки, основания, сварные фланцы и прочие изделия с требуемым
              повторяющимся качеством, в большом объеме, недоступном для
              «гражданских» сварочных работ.
            </p>
          </div>
          <img
            src="../assets/123769407_xl_normal_none.jpg"
            alt=""
          /></div
      ></swiper-slide>
      <swiper-slide
        ><div class="content">
          <div class="txt">
            <h1 class="text-xl">Контактная сварка изделий</h1>
            <p class="fz16">
              При сварке тонколистовых изделий недопустим объемный сварной шов
              или требуется более высокая скорость сварного соединения деталей.
              В таких случаях применяется контактная сварка, сохраняющая
              декоративный вид изделий и ускоряющая процесс сварки в несколько
              раз.
            </p>
          </div>
          <img
            src="../assets/120325950_xl_normal_none.jpg"
            alt=""
          /></div
      ></swiper-slide>
      <swiper-slide
        ><div class="content">
          <div class="txt">
            <h1 class="text-xl">
              Гибка, рубка, перфорирование тонколистовых габаритных изделий
            </h1>
            <p class="fz16">
              Изготовление отливов, рам, защитных экранов и кожухов, корпусов и
              прочих подобных изделий.
            </p>
          </div>
          <img
            src="../assets/131415065_xl_normal_none.jpg"
            alt=""
          /></div
      ></swiper-slide>
      <swiper-slide
        ><div class="content">
          <div class="txt">
            <h1 class="text-xl">Литье пластиковых изделий</h1>
            <p class="fz16">
              Цех пластикового литья с термопластавтоматами с объемом впрыска до
              400см3
            </p>
          </div>
          <img
            src="../assets/153298055_xl_normal_none.jpg"
            alt=""
          /></div
      ></swiper-slide>
      <swiper-slide
        ><div class="content">
          <div class="txt">
            <h1 class="text-xl">
              Проектирование и моделирование изделий и станочных оснасток для их
              производства.
            </h1>
            <p class="fz16">
              Для создания изделия необходим пакет чертежей на деталь и
              оснастку. Это работа конструкторского отдела завода. Полный
              инжиниринговый цикл – от разработки изделия, до проектирования
              техпроцесса изготовления продукции. При необходимости, внесем
              изменения в изделие, спроектируем новое, предложим замену
              материала, рассчитаем крепеж на допустимые нагрузки, посчитаем
              устойчивость к атмосферным воздействиям и проведем испытания.
            </p>
          </div>
          <img
            src="../assets/157407547_xl_normal_none.jpg"
            alt=""
          /></div
      ></swiper-slide>
      <swiper-slide
        ><div class="content">
          <div class="txt">
            <h1 class="text-xl">
              Планово-экономическое обоснование запуска новых изделий
            </h1>
            <p class="fz16">
              Несмотря на одинаковое количество материалов, использованных в
              производстве, в зависимости от поставленной задачи, крепеж может
              стоить по-разному. Если Вам требуются изделия в небольшом
              количестве, нет смысла изготавливать сложную и дорогую оснастку,
              гораздо дешевле и проще будет произвести заданное в ручных
              приспособлениях – так и сроки меньше, и есть место для экономии.
              Если у Вас потребность в массовой продукции, имеет смысл
              готовиться к большой работе, тут потребуется штамп-дублёр, а,
              может, и два. Всё это, со сроками и ценами Вам предоставит наш
              менеджер.
            </p>
          </div>
          <img
            src="../assets/50690842_xl_normal_none.jpg"
            alt=""
          /></div
      ></swiper-slide>
      <swiper-slide
        ><div class="content">
          <div class="txt">
            <h1 class="text-xl">
              Инженерное сопровождение изделия (расчет усилий, допустимых
              нагрузок, модификаций)
            </h1>
            <p class="fz16">
              В нашей практике, мы иногда сталкиваемся с необходимостью внесения
              небольших изменений в конструкцию изделия. Скорее всего, для этого
              не придётся изменять всю оснастку. Достаточно изменить лишь
              некоторые части. Мы всегда открыты новому, это – залог
              эволюционного развития.
            </p>
          </div>
          <img
            src="../assets/80331336_xl_normal_none.jpg"
            alt=""
          /></div
      ></swiper-slide>
    </swiper>
  </div>
</template>

<script setup>
import { Navigation, Pagination, Scrollbar, A11y } from "swiper/modules";
import { Swiper, SwiperSlide } from "swiper/vue";
// Import Swiper styles
import "swiper/css";
import "swiper/css/navigation";
import "swiper/css/pagination";
import "swiper/css/scrollbar";

const modules = [Navigation, Pagination, Scrollbar, A11y];
</script>

<style lang="scss" scoped>
@import "../fluid.sass";
.swiper__container {
  display: flex;
  align-items: center;
  height: 100%;
  background: #000;
}
.content {
  background: rgb(238, 107, 0);
  width: 100vw;
  height: 100vh;
}
.video {
  position: absolute;
  height: 100vh;
  width: 100vw;
  z-index: 1;
  object-fit: cover;
  filter: brightness(70%);
}
.swiper-button-next {
  color: #ffae00;
  user-select: none;
}
.swiper-button-prev {
  color: #ffae00;
  user-select: none;
}
.swiper-pagination-bullet {
  background: #ffae00;
}
.content {
  position: relative;
  display: flex;
  align-items: center;
  img {
    @include fluid("margin-left", 20);
    @include fluid("max-width", 600);
    @include fluid("max-height", 600);
  }
}
.text-xl {
  @include fluid("margin-bottom", 20);
  @include fluid("font-size", 46);
  color: #002f6c;
  font-weight: 600;
}
.txt {
  z-index: 2;
  @include fluid("margin-left", 150);
  width: 50%;
  .fz16 {
    @include fluid("font-size", 16);
  }
  p {
    @include fluid("margin-top", 30);
    @include fluid("font-size", 24);
  }
}
</style>
